app/Controllers/ActualActivity.php

    public function index()
    {
        // Retrieve filter parameters from GET; if missing, default to current month
        $start_date = $this->request->getGet('start_date') ?: date('Y-m-01'); // First day of current month
        $end_date   = $this->request->getGet('end_date')   ?: date('Y-m-t');  // Last day of current month

        // Build the query with the date filter
        $builder = $this->actualActivityModel
            ->select('actual_activity.*, users.nama AS created_by_name')
            ->join('users', 'users.id = actual_activity.created_by', 'left')
            ->where('users.status', 1)
            ->whereIn('actual_activity.status', [1, 7])
            ->where("DATE(actual_activity.dates) >=", $start_date)
            ->where("DATE(actual_activity.dates) <=", $end_date)
            ->orderBy('actual_activity.dates', 'DESC')
            ->orderBy('actual_activity.modified_at', 'ASC');

        $data['activities'] = $builder->findAll();
---
SELECT *
FROM `activities`
WHERE `status` = 1
SELECT *
FROM `actual_activity`
WHERE `status` IN (1,2)
AND `created_by` = '29'
ORDER BY `actual_activity`.`dates` DESC