app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `nik` = 'C.9294'
 LIMIT 1
SELECT *
FROM `role_features`
WHERE `role_id` = '5'
---
    public function attemptLogin() {
        $userModel = new UserModel();
        $nik = $this->request->getPost('nik');
        $password = $this->request->getPost('password');

        if (empty($nik) || empty($password)) {
            return redirect()->back()->with('error', 'NIK dan Password wajib diisi.');
        }

        $user = $userModel->where('nik', $nik)->first();

        if ($user) {
            if (password_verify($password, $user['password'])) {

                $roleFeatureModel = new \App\Models\RoleFeatureModel();
                $roleFeatures = $roleFeatureModel->where('role_id', $user['role_id'])->findAll();